docs/Books/happier.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-09 Thu 22:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Happier</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="chrischen" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css">
</head>
<body>
<div id="content">
<h1 class="title">Happier</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org395da72">What is happiness</a>
<ul>
<li><a href="#org8fefb65">Four archetypes of happiness</a></li>
</ul>
</li>
<li><a href="#org88ea762">Meaning, Pleasure, Strength(MPS)</a></li>
<li><a href="#org1f6a6cc">Relationships</a></li>
<li><a href="#org711cd1d">At work</a></li>
<li><a href="#orgd21d847">In life</a></li>
</ul>
</div>
</div>
<div id="outline-container-org395da72" class="outline-2">
<h2 id="org395da72">What is happiness</h2>
<div class="outline-text-2" id="text-org395da72">
<p>
<b>Pleasure</b> and <b>meaning</b> are central to living a happy and fulfilled life.
</p>
<ul class="org-ul">
<li><b>Meaningful</b>: To set appropriate goals</li>
</ul>
</div>

<div id="outline-container-org8fefb65" class="outline-3">
<h3 id="org8fefb65">Four archetypes of happiness</h3>
<div class="outline-text-3" id="text-org8fefb65">
<ul class="org-ul">
<li>rat-race archetype
<ul class="org-ul">
<li>Pursues the future benefit and neglects present benefit.</li>
<li>The painful path must be taken before being able to attain future happiness</li>
</ul></li>
<li>hedonism archetype: Opposite to the rat-race archetype
<ul class="org-ul">
<li>Only values present benefit and ignores future benefit.</li>
</ul></li>
<li>nihilism archetype
<ul class="org-ul">
<li>Neither enjoys what they have in the present, nor have any hope for the future.</li>
<li>Have lost faith and desire in life.</li>
</ul></li>
<li>happiness archetype</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org88ea762" class="outline-2">
<h2 id="org88ea762">Meaning, Pleasure, Strength(MPS)</h2>
<div class="outline-text-2" id="text-org88ea762">
<p>
Begin by writing three answers:
</p>
<ul class="org-ul">
<li>What do I find meaningful? e.g. writing, music, working with kids, solving problems.</li>
<li>Where do I find pleasure? e.g. horseback riding, reading, music and time with children.</li>
<li>Where are my strengths? e.g. empathy, problem solving and getting along with kids.</li>
</ul>

<p>
Notice the overlaps &#x2013; working with kids for example. Your strengths might be highly organized,
enjoy planning and love to travel. Then, you might decide to become a music teacher.
</p>
</div>
</div>

<div id="outline-container-org1f6a6cc" class="outline-2">
<h2 id="org1f6a6cc">Relationships</h2>
<div class="outline-text-2" id="text-org1f6a6cc">
<p>
The more effort you put into cultivating meaningful relationships in your life, The happier you
will be. Key points:
</p>
<ul class="org-ul">
<li>Sharing joy is pleasurable experience</li>
<li>Sharing sorrow can be comforting during painful times.</li>
<li>A hedonistic relationship that's solely focused on pleasure will rapidly lose its meaning.</li>
<li>A relationship based on shared values but lacking pleasure will also struggle.</li>
</ul>
</div>
</div>

<div id="outline-container-org711cd1d" class="outline-2">
<h2 id="org711cd1d">At work</h2>
<div class="outline-text-2" id="text-org711cd1d">
<ul class="org-ul">
<li>Creating flow experiences. Let flow happen <b>naturally</b>.
<ul class="org-ul">
<li><b>Flow</b>: immersed in an experience.</li>
<li>By Adjusting our work tasks to make their level of difficulty match our personal skills.</li>
</ul></li>
<li>Using the MPS process to find a job or make life decisions.</li>
<li>Developing/Cultivating a sense of purpose.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd21d847" class="outline-2">
<h2 id="orgd21d847">In life</h2>
<div class="outline-text-2" id="text-orgd21d847">
<ul class="org-ul">
<li><b>Cultivating</b> love over finding love</li>
<li>Creating an invisible circle of happiness around ourselves.</li>
<li>Cultivating "happiness boosters" as a daily habit. Finding small habits that provide us happy experiences.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
